lsh0223/stm32websystem/stm32Project/USER/main.c
        if ((g_idle_occupy_alarm || g_smoke_alarm) && (g_app.maint_mode == 0)) {
            if ((now % 200) < 100) Seat_Buzzer_Set(1);
            else Seat_Buzzer_Set(0);
        } else {
            Seat_Buzzer_Set(0); 
        }

        if ((g_screen == SCREEN_WELCOME) && (g_app.state == STATE_IDLE) && (g_app.maint_mode == 0)) {
            if (g_wait_card_auth == 0 && now > g_card_cooldown_tick) {
                if (RFID_CheckCard(uid)) {
                    App_OnCard(uid);
                    g_card_cooldown_tick = now + 3000; 
                }
            }
        }

        if (now - g_last_1s >= 1000) {
            if (now - g_last_1s > 5000) g_last_1s = now;
            else g_last_1s += 1000;
            App_Task_1s();
        }

        if (ESP8266_GetState() == WIFI_STATE_RUNNING) {
            if (now - g_last_mqtt >= 1000) {
                if (now - g_last_mqtt > 5000) g_last_mqtt = now;
                else g_last_mqtt += 1000;
                Netbar_Publish_SeatState();
            }
        }
    }
}

static void App_Task_1s(void)
{
    u8  human;
    u16 smoke_adc;
    u8  smoke_percent;
    float bal_f = 0.0f;
    char msg_buf[32];
    char topic[64]; // ★★★ 用于动态生成Topic ★★★

    if (esp8266_remote_reset_flag) {
        esp8266_remote_reset_flag = 0;
        App_InitContext(); 
        g_screen = SCREEN_WELCOME;
        g_confirm = CONFIRM_NONE;
        UI_DrawWelcomeStatic();
        ESP8266_Init_Async(); 
        UI_ShowServerMsg("系统已重置");
        g_server_msg_secs = 3; 
        return;                 
    }

    if (esp8266_remote_set_rate_flag) {
        esp8266_remote_set_rate_flag = 0;
        g_price_per_min = esp8266_remote_rate_val;
        Save_Rate_To_EEPROM(g_price_per_min);
        sprintf(msg_buf, "费率更新: %.1f元/分", g_price_per_min);
        UI_ShowServerMsg(msg_buf);
        g_server_msg_secs = 3;
        
        if (g_screen == SCREEN_WELCOME) UI_DrawWelcomeStatic();
        else if (g_screen == SCREEN_INUSE) {
            UI_DrawInuseStatic(); 
            UI_UpdateStateLine(); 
            UI_UpdateUserLine(); 
            UI_UpdateCardLine(); 
            UI_UpdateBalanceLine(); 
            UI_UpdateRuntimeAndFee(); 
            UI_UpdatePCButton(); 
            UI_UpdateLightButton();
        }
    }

    if (esp8266_remote_maint_on_flag) {
        esp8266_remote_maint_on_flag = 0;
        g_app.maint_mode = 1;
        g_idle_occupy_alarm = 0;
        g_smoke_alarm = 0;
        g_screen = SCREEN_MAINTENANCE;
        UI_DrawMaintenanceStatic(); 
        UI_ShowServerMsg("已进入维护模式");
        g_server_msg_secs = 3;
    }
    if (esp8266_remote_maint_off_flag) {
        esp8266_remote_maint_off_flag = 0;
        g_app.maint_mode = 0;
        g_screen = SCREEN_WELCOME;
        UI_DrawWelcomeStatic();
        UI_ShowServerMsg("维护结束，恢复正常");
        g_server_msg_secs = 3;
    }

    if (esp8266_remote_pc_on_flag) {
        esp8266_remote_pc_on_flag = 0;
        g_app.pc_on = 1; Seat_PC_Set(1);
        if (g_screen == SCREEN_INUSE) UI_UpdatePCButton();
        Netbar_Publish_SeatState();
    }
    if (esp8266_remote_pc_off_flag) {
        esp8266_remote_pc_off_flag = 0;
        g_app.pc_on = 0; Seat_PC_Set(0);
        if (g_screen == SCREEN_INUSE) UI_UpdatePCButton();
        Netbar_Publish_SeatState();
    }
    if (esp8266_remote_light_on_flag) {
        esp8266_remote_light_on_flag = 0;
        g_app.light_on = 1; Seat_Light_Set(1);
        if (g_screen == SCREEN_INUSE) UI_UpdateLightButton();
        Netbar_Publish_SeatState();
    }
    if (esp8266_remote_light_off_flag) {
        esp8266_remote_light_off_flag = 0;
        g_app.light_on = 0; Seat_Light_Set(0);
        if (g_screen == SCREEN_INUSE) UI_UpdateLightButton();
        Netbar_Publish_SeatState();
    }
    if (esp8266_remote_checkout_flag) {
        esp8266_remote_checkout_flag = 0;
        if (g_app.state == STATE_INUSE) {
            App_EndSession();       
        }
    }
    if (esp8266_remote_msg_flag) {
        esp8266_remote_msg_flag = 0;
        g_server_msg_secs       = 5;      
        UI_ShowServerMsg(esp8266_remote_msg);
    }

    if (esp8266_remote_card_ok_flag) {
        esp8266_remote_card_ok_flag = 0;
        g_wait_card_auth = 0;
        
        if (g_app.has_user == 0) {
            UID_HexStr_To_Bytes(esp8266_remote_uid, g_app.uid);
            g_app.has_user = 1;
        }

        g_app.used_seconds = esp8266_remote_restore_sec; 
        memset(g_app.user_name, 0, sizeof(g_app.user_name));
        strcpy((char*)g_app.user_name, esp8266_remote_user_name);
        sscanf(esp8266_remote_balance_str, "%f", &bal_f);
        g_app.balance = (u32)(bal_f * 100);
        
        if (g_app.state != STATE_INUSE) {
            g_app.state = STATE_INUSE;
            g_app.pc_on = 1; g_app.light_on = 1;
            Seat_PC_Set(1); Seat_Light_Set(1);
            g_screen = SCREEN_INUSE;
            g_confirm = CONFIRM_NONE;
            UI_DrawInuseStatic();
            if (g_app.used_seconds > 0) UI_ShowServerMsg("会话已恢复");
            else UI_ShowServerMsg("刷卡成功");
        }
        UI_UpdateStateLine(); 
        UI_UpdateUserLine(); 
        UI_UpdateCardLine(); 
        UI_UpdateBalanceLine(); 
        UI_UpdateRuntimeAndFee(); 
        UI_UpdatePCButton(); 
        UI_UpdateLightButton();
        g_server_msg_secs = 3;
    }
    if (esp8266_remote_card_err_flag) {
        esp8266_remote_card_err_flag = 0;
        g_wait_card_auth = 0;
        UI_ShowServerMsg(esp8266_card_err_msg[0] ? esp8266_card_err_msg : "刷卡失败");
        g_server_msg_secs = 5;
        g_app.has_user = 0;
        g_card_cooldown_tick = GetSysMs() + 3000;
    }
    if (g_wait_card_auth && GetSysMs() - g_card_auth_tick >= 5000) {
        g_wait_card_auth = 0;
        UI_ShowServerMsg("验证超时");
        g_server_msg_secs = 3;
        g_card_cooldown_tick = GetSysMs() + 3000;
    }

    if (g_server_msg_secs > 0) {
        g_server_msg_secs--;
        if (g_server_msg_secs == 0) UI_ClearServerMsg();
    }

    if ((g_app.state == STATE_INUSE) && (g_screen == SCREEN_INUSE)) {
        g_app.used_seconds++;
        if (g_smoke_alarm == 0 && g_idle_occupy_alarm == 0) {
            UI_UpdateRuntimeAndFee();   
        }
    }

    // 报警检测
    human         = Seat_Radar_Get();
    smoke_adc     = Seat_Smoke_GetRaw();
    smoke_percent = Smoke_AdcToPercent(smoke_adc);

    if (g_app.maint_mode == 0) 
    {
        if (smoke_percent >= 60) {
            if (g_smoke_alarm == 0) {
                g_smoke_alarm = 1;
                UI_DrawAlarmWindow("危险!", "烟雾报警");
            }
        } else {
            if (g_smoke_alarm == 1) {
                g_smoke_alarm = 0;
                UI_ClearAlarmWindow(); 
            }
        }

        if ((g_screen == SCREEN_WELCOME) && (g_app.state == STATE_IDLE)) {
            if (human) {
                if (g_idle_human_seconds < 0xFFFFFFFF) g_idle_human_seconds++;
                if ((g_idle_human_seconds >= 3) && (g_idle_occupy_alarm == 0)) {
                    g_idle_occupy_alarm = 1;
                    // ★★★ 动态Topic ★★★
                    sprintf(topic, "netbar/%s/alert", g_device_id);
                    ESP8266_MQTT_Pub_Async(topic, "occupy_over_120s");
                    UI_DrawAlarmWindow("警告", "请勿占座!");
                }
            } else {
                if (g_idle_occupy_alarm == 1) {
                    g_idle_occupy_alarm = 0;
                    UI_ClearAlarmWindow(); 
                }
                g_idle_human_seconds = 0;
            }
        } else {
            g_idle_occupy_alarm = 0;
            g_idle_human_seconds = 0;
        }
    } 
    else 
    {
        g_idle_occupy_alarm = 0;
        g_smoke_alarm = 0;
    }

    if (g_app.state == STATE_INUSE) {
        if (human) g_inuse_nohuman_seconds = 0;
        else {
            if (g_inuse_nohuman_seconds < 0xFFFFFFFF) g_inuse_nohuman_seconds++;
            if (g_inuse_nohuman_seconds >= 15 * 60 / 90) {
                // ★★★ 动态Topic ★★★
                sprintf(topic, "netbar/%s/alert", g_device_id);
                ESP8266_MQTT_Pub_Async(topic, "auto_checkout_nohuman_15min");
                App_EndSession();
                g_inuse_nohuman_seconds = 0;
            }
        }
    }

    if (g_app.maint_mode == 0 && g_smoke_alarm == 0 && g_idle_occupy_alarm == 0) {
        if (g_screen == SCREEN_WELCOME) UI_UpdateEnvWelcome(human, smoke_percent);
        else if (g_screen == SCREEN_INUSE) UI_UpdateEnvInuse(human, smoke_percent);
    }

    UI_UpdateWifiIcon();
}

